Config/Catalogs/RoomProperties.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>RoomProperties</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>SortCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsView</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ShowInPropertiesList</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>KeepRoomsWithoutProperty</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/InformationRegisters/RoomProperties.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>RoomProperties</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ChangeDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Room</Name>
					<Comment>Номер</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Rooms</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>RoomProperty</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RoomProperties</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Catalogs/RoomProperties/Ext/ObjectModule.bsl
#Region EventHandlers

// --------------------------------------------------------------------------------
Procedure BeforeWrite(pCancel)
	If DataExchange.Load Then
		Return;
	EndIf;
	If Not cmCheckUserPermissions("HavePermissionToManageRoomInventory") Then
		tcCommonFunctionOnClientServer.TextMessage(NStr("en='You do not have rights for room inventory management!';ru='Нет прав на управление номерным фондом!';de='Sie haben keine Rechte, den Zimmerfond zu verwalten!'"));
		pCancel = True;
	EndIf;
EndProcedure

// --------------------------------------------------------------------------------
Procedure OnWrite(pCancel)  
	If DataExchange.Load Then
		Return;
	EndIf;
	If ValueIsFilled(Ref) And Not IsFolder Then
		If DeletionMark Then
			// Remove property from all rooms
			vPropertyRooms = InformationRegisters.RoomProperties.CreateRecordSet();
			vPropertyRooms.Filter.RoomProperty.Set(Ref);
			vPropertyRooms.Clear();
			vPropertyRooms.Write(True);
		Else
			vPropertyRoomsRow = InformationRegisters.RoomProperties.Select(New Structure("RoomProperty", Ref));
			While vPropertyRoomsRow.Next() Do
				vRoom = vPropertyRoomsRow.Room;
				If ValueIsFilled(vRoom) And Not vRoom.IsFolder Then
					vRoomObj = vRoom.GetObject();
					vRoomObj.RoomPropertiesCodes = "";
					vRoomObj.RoomPropertiesDescriptions = "";
					vRoomPropertyRow = cmGetRoomPropertiesForRoom(vRoom);
					While vRoomPropertyRow.Next() Do
						vRoomPropertyRef = vRoomPropertyRow.RoomProperty;
						If ValueIsFilled(vRoomPropertyRef) And vRoomPropertyRef.ShowInPropertiesList Then
							If IsBlankString(vRoomObj.RoomPropertiesCodes) Then
								vRoomObj.RoomPropertiesCodes = TrimAll(vRoomPropertyRef.Code);
								vRoomObj.RoomPropertiesDescriptions = TrimAll(vRoomPropertyRef.Description);
							Else
								vRoomObj.RoomPropertiesCodes = TrimAll(vRoomObj.RoomPropertiesCodes) + Chars.LF + TrimAll(vRoomPropertyRef.Code);
								vRoomObj.RoomPropertiesDescriptions = TrimAll(vRoomObj.RoomPropertiesDescriptions) + Chars.LF + TrimAll(vRoomPropertyRef.Description);
							EndIf;
						EndIf;
					EndDo;
					vRoomObj.Write();
				EndIf;
			EndDo;
		EndIf;
	EndIf;
EndProcedure // OnWrite

#EndRegion
